uri.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-20 Thu 15:51 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Undergraduate Research Internship</title>
<meta name="author" content="Meesue Yoo" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Undergraduate Research Internship</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org27633b9">1. Goal of the program</a></li>
<li><a href="#orgf16e780">2. Timetable</a></li>
<li><a href="#orgf9b2ecd">3. References</a>
<ul>
<li><a href="#orge64665b">3.1. Herbert S. Wilf, 'Generatingfunctionology'</a></li>
<li><a href="#orgcccd828">3.2. "The case of the strange binomial identities of professor Moriarty", by H. W. Gould</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org27633b9" class="outline-2">
<h2 id="org27633b9"><span class="section-number-2">1.</span> Goal of the program</h2>
<div class="outline-text-2" id="text-1">
<p>
Generating functions are a powerful tool in combinatorics, providing a bridge between discrete structures and analytic methods. Here, we explore how generating functions encode sequences, allowing us to solve recurrence relations, count combinatorial objects, and analyze asymptotic behavior. Topics include ordinary and exponential generating functions, transformations and operations on generating functions, applications to counting problems, and connections to probability and number theory. 
</p>
</div>
</div>

<div id="outline-container-orgf16e780" class="outline-2">
<h2 id="orgf16e780"><span class="section-number-2">2.</span> Timetable</h2>
<div class="outline-text-2" id="text-2">
<p>
We meet on Colloquium-free Thursdays. 
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Chapter</th>
<th scope="col" class="org-left">Contents</th>
<th scope="col" class="org-left">Speaker</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">3/20</td>
<td class="org-left">Chap 1</td>
<td class="org-left">Introductory ideas and examples</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/3</td>
<td class="org-left">Chap 2</td>
<td class="org-left">2.1 Formal power series</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.2 The calculus of formal ordinary power series generating functions</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/17</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.3 The calculus of formal exponential generating functions</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.4 Power series, analytic theory</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.5 Some useful power series</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">5/2 (Fri)</td>
<td class="org-left">Chap 3</td>
<td class="org-left">3.2 Definitions and a question</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.3 Examples of exponential families</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">5/15</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.4 The main counting theorems</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.5 Permutations and their cycles</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.6 Set partitions</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">5/29</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.7 A subclass of permutations</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.8 Involutions, etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.9 2-regular graphs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">6/5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.10 Counting connected graphs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.11 Counting labeled bipartite graphs</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">3.12 Counting labeled trees</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">6/19</td>
<td class="org-left">Chap 4</td>
<td class="org-left">4.2 A generatingfunctionological view of the sieve method</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4.3 The ‘Snake Oil’ method for easier combinatorial identities</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4.5 Generating functions and unimodality, convexity, etc.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Chap 5</td>
<td class="org-left">5.1 The Lagrange Inversion Formula</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf9b2ecd" class="outline-2">
<h2 id="orgf9b2ecd"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge64665b" class="outline-3">
<h3 id="orge64665b"><span class="section-number-3">3.1.</span> Herbert S. Wilf, 'Generatingfunctionology'</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://www2.math.upenn.edu/~wilf/gfology2.pdf">Link to the book</a>
</p>
</div>
</div>
<div id="outline-container-orgcccd828" class="outline-3">
<h3 id="orgcccd828"><span class="section-number-3">3.2.</span> "The case of the strange binomial identities of professor Moriarty", by H. W. Gould</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://meesue.github.io/moriartyid.pdf">Link to the file</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Meesue Yoo</p>
<p class="date">Created: 2025-03-20 Thu 15:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
